# WidthInPixels Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableData..::..WidthInPixels Property
TableData Class See Also
---
Gets the width of the panel schedule in logical pixels
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int WidthInPixels { get; }
```

Visual Basic
---
```text
Public ReadOnly Property WidthInPixels As Integer
	Get
```

Visual C++
---
```text
public:
property int WidthInPixels {
	int get ();
}
```

# See Also
TableData Class
Autodesk.Revit.DB Namespace